VibeCoding-tw/esp32c3-launcher/src/main.cpp
// 包含必要的庫
#include <Arduino.h>
#include <WiFi.h>
#include <WebServer.h>               // Web Server
#include <ArduinoOTA.h>              // 透過網路進行韌體更新
#include <ESPmDNS.h>                 // 區域網路名稱解析
#include "esp_ota_ops.h"             // OTA 相關操作
#include "esp_partition.h"           // 分區表操作
#include "esp_task_wdt.h"            // Watchdog Timer 函式庫
#include "esp32c3_gpio.h"            // 此處定義了 GPIO 腳位 (例如: AIN1_PIN, NSLEEP_PIN, BIN1_PIN, BIN2_PIN)

#include <BLEDevice.h>
#include <BLEServer.h>
#include <BLEUtils.h>
#include <BLE2902.h>
#include <Preferences.h>             // 用於儲存 Wi-Fi 憑證及馬達參數
#include <freertos/FreeRTOS.h>       // 繼續使用 FreeRTOS 任務功能
#include <freertos/task.h>

// --- 全域變數 ---
String globalHostname;               // 基於 MAC 位址的唯一 Hostname
WebServer server(80);                // 實例化同步 Web Server

// LEDC PWM 設定 (保持不變)
const int PWM_FREQ = 20000;
const int PWM_RESOLUTION = 8;
const int PWM_MAX = 255;
const int LEDC_CH_A1 = 0;
const int LEDC_CH_A2 = 1;
const int LEDC_CH_B1 = 2;
const int LEDC_CH_B2 = 3;

// --- 馬達 Ramping 參數結構體 (與需求一致) ---
typedef struct {
    unsigned long controlTimeoutMs; 
    int pwmEffectiveLimitT; 
    int rampAccelStepT; 
    int pwmStartKickT; 
    int pwmEffectiveLimitS; 
    int rampAccelStepS; 
    int pwmStartKickS;
} MotorConfig_t;

// 【修正點 2】馬達 Ramping 核心變數
Preferences preferences;             // 全局 NVS 實例
MotorConfig_t motorConfig;           // 實例化結構體來存儲當前參數

volatile unsigned long lastControlTime = 0; // 上次接收到控制命令的時間戳記
volatile int targetSpeedT = 0;             // 遙控器送來的目標速度 (T Motor)
volatile int currentSpeedT = 0;            // 當前實際輸出給 PWM 的速度
volatile int targetSpeedS = 0;             // 遙控器送來的目標速度 (S Motor)
volatile int currentSpeedS = 0;            // 當前實際輸出給 PWM 的速度
const int RAMP_INTERVAL_MS = 10;           // 馬達斜坡控制間隔 (100Hz)
unsigned long lastRampTime = 0;

// --- BLE UUID 定義 (使用固定且唯一的 UUIDs) ---
// 服務 (Service)
const char* CONFIG_SERVICE_UUID  = "6e400001-b5a3-f393-e0a9-e50e24dcca9e"; 
const char* MOTOR_SERVICE_UUID   = "4fafc201-1fb5-459e-8fcc-c0ffee00dead"; 

// 特徵 (Characteristic) - **確保唯一性**
#define SSID_CHAR_UUID          "6e400002-b5a3-f393-e0a9-e50e24dcca9e" // Wi-Fi SSID (Write)
#define PASS_CHAR_UUID          "6e400003-b5a3-f393-e0a9-e50e24dcca9e" // Wi-Fi PASS (Write)
#define MOTOR_CONTROL_CHAR_UUID "4fafc202-1fb5-459e-8fcc-c0ffee01feed" // 馬達即時控制 (Write/Notify)
#define MOTOR_CONFIG_CHAR_UUID  "4fafc203-1fb5-459e-8fcc-c0ffee02dead" // 馬達配置參數 (Read/Write/Notify)

// --- 全域變數：BLE / NVS ---
BLEServer *pServer = NULL;
BLECharacteristic *pControlCharacteristic = NULL;
BLECharacteristic *pSsidCharacteristic = NULL;
BLECharacteristic *pPassCharacteristic = NULL;
BLECharacteristic *pMotorConfigCharacteristic = NULL; // 新增馬達配置特徵
String ble_ssid;
String ble_pass;
bool wifi_config_received = false;
volatile bool should_restart_advertising = false;
bool servicesStarted = false;
float batteryVoltage = 0.0;          // 電池電壓 ( filtered )
const float ADC_VOLT_REF = 3.1;      // ESP32-C3 ADC 參考電壓 ( 依實際情況微調 )
const float DIVIDER_RATIO = 2.0;     // 分壓比例 ( 100k+100k )
unsigned long lastBatteryCheck = 0;
const int BATT_CHECK_INTERVAL = 500; // 每 500ms 檢查一次

// --- HTML 網頁內容 ---
const char* HTML_CONTENT = R"rawliteral(
<!DOCTYPE html>
<html>
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>VibeRcer 搖桿控制</title>
    <script src="https://cdn.tailwindcss.com"></script>
    <style>
        /* 確保全螢幕高度和柔軟的背景色 */
        body { 
            background-color: #1f2937; 
            color: #f9fafb; 
            font-family: ui-sans-serif, system-ui, -apple-system, BlinkMacSystemFont, "Segoe UI", Roboto, "Helvetica Neue", Arial, "Noto Sans", sans-serif;
            display: flex; 
            justify-content: center; 
            align-items: center; 
            min-height: 100vh; 
            margin: 0; 
            padding: 1rem;
        }
        .container { 
            max-width: 400px; 
            width: 100%; 
            padding: 20px; 
        }
        /* 搖桿圓盤樣式 */
        #joystick { 
            position: relative; 
            width: 100%;
            padding-top: 100%; /* 1:1 比例 */
            margin: 0 auto; 
            border-radius: 50%; 
            background: linear-gradient(145deg, #2d3748, #1a202c); 
            box-shadow: 10px 10px 20px #171d26, -10px -10px 20px #273142, inset 0 0 10px rgba(0,0,0,0.5);
            touch-action: none; /* 禁用瀏覽器預設的觸摸行為 */
        }
        /* 實際可拖曳區域 (內縮 5% 讓邊緣有陰影效果) */
        #joystick-inner {
            position: absolute;
            top: 5%; left: 5%; right: 5%; bottom: 5%;
            width: 90%;
            height: 90%;
        }
        /* 搖桿中心點 (Thumb) */
        #joystick-thumb {
            position: absolute;
            width: 70px; 
            height: 70px;
            top: 50%;
            left: 50%;
            transform: translate(-50%, -50%);
            border-radius: 50%;
            background: #4f46e5;
            box-shadow: 0 0 15px #4f46e5, inset 0 0 10px #7c3aed;
            cursor: grab;
            transition: box-shadow 0.1s;
        }
        #joystick-thumb.active { cursor: grabbing; box-shadow: 0 0 25px #7c3aed, inset 0 0 15px #4f46e5; }
        /* 狀態文字 */
        #status { font-weight: 700; text-shadow: 0 0 5px rgba(79, 70, 229, 0.5); }
    </style>
</head>
<body class="p-4">
    <div class="container bg-gray-800 rounded-xl shadow-2xl">
        <h1 class="text-3xl font-extrabold text-center text-indigo-400 mb-2">Vibe Racer</h1>
        <p class="text-center text-sm mb-4 text-gray-400">
            裝置: <span id="hostname">%HOSTNAME%</span> | <span id="ipaddress">%IPADDRESS%</span>
        </p>

        <!-- 電量與診斷資訊 -->
        <div class="flex justify-between items-center bg-gray-900/50 rounded-lg p-3 mb-6 border border-gray-700">
            <div class="text-left">
                <p class="text-xs text-gray-500 uppercase tracking-wider">電池電壓</p>
                <p class="text-xl font-mono font-bold text-green-400"><span id="val_v">0.00</span>V</p>
            </div>
            <div class="text-right">
                <p class="text-xs text-gray-500 uppercase tracking-wider">即時功率 (Ramp)</p>
                <p class="text-sm font-mono text-indigo-300">T: <span id="val_rt">0</span> | S: <span id="val_rs">0</span></p>
            </div>
        </div>

