VibeCoding-tw/esp32c3-launcher/src/main.cpp
        <div id="joystick" class="mb-6">
            <div id="joystick-inner">
                 <div id="joystick-thumb"></div>
            </div>
        </div>

        <div class="text-center space-y-2 pb-4">
            <p class="text-xl">狀態: <span id="status" class="text-green-400">靜止</span></p>
            <p class="text-xs text-gray-500">
                目標 X: <span id="val_x">0</span> | 目標 Y: <span id="val_y">0</span>
            </p>
        </div>
    </div>

    <script>
        const joystickContainer = document.getElementById('joystick'); 
        const joystick = document.getElementById('joystick-inner'); 
        const thumb = document.getElementById('joystick-thumb');
        const statusEl = document.getElementById('status');
        const valXEl = document.getElementById('val_x');
        const valYEl = document.getElementById('val_y');
        const valVEl = document.getElementById('val_v');
        const valRTEl = document.getElementById('val_rt');
        const valRSELEl = document.getElementById('val_rs');
        
        const DEADZONE_PWM = 20; 
        const maxRadius = joystick.clientWidth / 2;
        let isDragging = false;
        let controlInterval;
        let lastMotorT = 0;
        let lastMotorS = 0;
        const baseIp = ''; 
        
        function updateMotorValues(rawX, rawY) {
            const distance = Math.sqrt(rawX*rawX + rawY*rawY);
            const magnitude = Math.min(1.0, distance / maxRadius);
            const angle = Math.atan2(rawY, rawX);
            
            const normX = magnitude * Math.cos(angle); 
            const normY = magnitude * Math.sin(angle); 

            let speedT = Math.round(normY * 255);
            let speedS = Math.round(normX * 255);

            if (Math.abs(speedT) < DEADZONE_PWM) speedT = 0;
            if (Math.abs(speedS) < DEADZONE_PWM) speedS = 0;

            valYEl.textContent = speedT;
            valXEl.textContent = speedS;
            
            let currentStatus = "靜止";
            let statusColor = "text-green-400";
            if (Math.abs(speedT) > 0 || Math.abs(speedS) > 0) {
                 statusColor = "text-yellow-400";
                 if (speedT > 50 && Math.abs(speedS) < 50) currentStatus = "前進中";
                 else if (speedT < -50 && Math.abs(speedS) < 50) currentStatus = "後退中";
                 else if (speedS > 50) currentStatus = "右轉中";
                 else if (speedS < -50) currentStatus = "左轉中";
                 else currentStatus = "移動中";
            }
            statusEl.textContent = currentStatus;
            statusEl.className = statusEl.className.replace(/text-\w+-\d+/, statusColor);

            if (speedT !== lastMotorT || speedS !== lastMotorS) {
                lastMotorT = speedT;
                lastMotorS = speedS;
                sendControl(speedT, speedS); 
            }
        }

        function sendControl(T, S) {
            fetch(`${baseIp}/control?t=${T}&s=${S}`)
                .then(response => response.json())
                .then(data => {
                    // 更新電壓與即時 Ramp 數值
                    if (data.v !== undefined) {
                        valVEl.textContent = data.v.toFixed(2);
                        // 低電壓警示 (假設 1S 鋰電池 3.4V)
                        if (data.v < 3.4) valVEl.className = "text-red-500";
                        else if (data.v < 3.6) valVEl.className = "text-yellow-400";
                        else valVEl.className = "text-green-400";
                    }
                    if (data.rt !== undefined) valRTEl.textContent = data.rt;
                    if (data.rs !== undefined) valRSELEl.textContent = data.rs;
                })
                .catch(err => console.error('Fetch error:', err));
        }

        function resetThumbPosition() {
            thumb.style.left = '50%';
            thumb.style.top = '50%';
            thumb.style.transform = 'translate(-50%, -50%)';
            thumb.classList.remove('active');
        }

        function stopMotors() {
            isDragging = false;
            if (controlInterval) clearInterval(controlInterval);
            resetThumbPosition();
            // 發送 T=0, S=0，觸發 ESP32 端的即時停止
            updateMotorValues(0, 0); 
        }

        function handleMove(e) {
            e.preventDefault();
            if (!isDragging) return;

            // 取得觸摸或滑鼠位置
            const clientX = e.touches ? e.touches[0].clientX : e.clientX;
            const clientY = e.touches ? e.touches[0].clientY : e.clientY;

            // 取得搖桿容器 (joystick-inner) 的位置
            const rect = joystick.getBoundingClientRect();
            const centerX = rect.left + maxRadius;
            const centerY = rect.top + maxRadius;

            // 1. 原始位移 (CSS 座標: X 向右為正, Y 向下為正)
            let offsetX = clientX - centerX;
            let offsetY = clientY - centerY; 
            
            // 2. 限制位移在搖桿圓盤內
            const distance = Math.sqrt(offsetX * offsetX + offsetY * offsetY);
            if (distance > maxRadius) {
                const angle = Math.atan2(offsetY, offsetX);
                offsetX = maxRadius * Math.cos(angle);
                offsetY = maxRadius * Math.sin(angle);
            }
            
            // 3. 更新搖桿中心點位置 (使用 CSS 座標)
            const thumbX = maxRadius + offsetX;
            const thumbY = maxRadius + offsetY; 

            thumb.style.left = `${thumbX}px`;
            thumb.style.top = `${thumbY}px`;
            thumb.style.transform = 'translate(-50%, -50%)';

            // 4. 更新馬達值 (使用 Cartesian 座標: Y 軸向上為正)
            // 將 CSS Y 軸反轉: -offsetY
            updateMotorValues(offsetX, -offsetY);
        }

        function handleStart(e) {
            isDragging = true;
            thumb.classList.add('active');
            handleMove(e); // 立即更新一次位置和值

            // 設置間隔發送，確保命令持續性
            if (controlInterval) clearInterval(controlInterval);
            controlInterval = setInterval(() => {
                // 重新讀取上次計算的值並發送，確保命令持續性
                sendControl(lastMotorT, lastMotorS);
            }, 100); // 每 100ms 發送一次
        }

        function handleEnd() {
            stopMotors();
        }

        // --- 事件監聽 ---
        joystick.addEventListener('mousedown', handleStart);
        document.addEventListener('mousemove', handleMove);
        document.addEventListener('mouseup', handleEnd);

        joystick.addEventListener('touchstart', handleStart);
        document.addEventListener('touchmove', handleMove);
        joystickContainer.addEventListener('touchend', handleEnd); 

