VibeCoding-tw/esp32c3-launcher/src/main.cpp
    Serial.printf("嘗試連線到儲存的 Wi-Fi: %s\n", saved_ssid.c_str());
    WiFi.setHostname(globalHostname.c_str());
    WiFi.mode(WIFI_STA); 
    WiFi.begin(saved_ssid.c_str(), saved_pass.c_str());
}

// --- BLE 連線狀態回調 ---
class MyServerCallbacks: public BLEServerCallbacks {
    void onConnect(BLEServer* pServer) {
        vTaskDelay(pdMS_TO_TICKS(1)); 
        Serial.println("✅ BLE Client Connected.");
        // 連線時通知客戶端當前配置
        if (pMotorConfigCharacteristic) {
            pMotorConfigCharacteristic->setValue((uint8_t*)&motorConfig, sizeof(MotorConfig_t));
            pMotorConfigCharacteristic->notify();
        }
    }
    void onDisconnect(BLEServer* pServer) {
        Serial.println("❌ BLE Client Disconnected. Setting flag to restart...");
        should_restart_advertising = true; 
        vTaskDelay(pdMS_TO_TICKS(5));
    }
};

// --- BLE 特徵寫入回調 (控制) ---
class MyCharacteristicCallbacks: public BLECharacteristicCallbacks {
    void onWrite(BLECharacteristic* pCharacteristic) {
        std::string rxValue = pCharacteristic->getValue();
        if (rxValue.length() > 0) {
            String command = String(rxValue.c_str());
            Serial.printf("[BLE CMD] Received RAW: %s\n", command.c_str()); 
            
            int commaIndex = command.indexOf(',');
            if (commaIndex > 0) {
                int rawT = command.substring(0, commaIndex).toInt();
                int rawS = command.substring(commaIndex + 1).toInt();
                
                // 使用 Limit 參數進行約束
                targetSpeedT = constrain(rawT, -motorConfig.pwmEffectiveLimitT, motorConfig.pwmEffectiveLimitT); 
                targetSpeedS = constrain(rawS, -motorConfig.pwmEffectiveLimitS, motorConfig.pwmEffectiveLimitS);
                
                lastControlTime = millis(); 
                Serial.printf("  -> Target Set: T=%d, S=%d\n", targetSpeedT, targetSpeedS);
            }
        }
    }
};

// 處理馬達配置參數
class MotorConfigCharacteristicCallbacks: public BLECharacteristicCallbacks {
    void onRead(BLECharacteristic* pCharacteristic) {
        // 客戶端讀取時，將當前 motorConfig 結構體以二進位方式傳輸
        pCharacteristic->setValue((uint8_t*)&motorConfig, sizeof(MotorConfig_t));
        Serial.println("[BLE Config] Motor config read request served.");
    }

    void onWrite(BLECharacteristic* pCharacteristic) {
        // 客戶端寫入時，將二進位資料直接寫入 motorConfig 結構體
        std::string rxValue = pCharacteristic->getValue();
        if (rxValue.length() == sizeof(MotorConfig_t)) {
            memcpy((void*)&motorConfig, rxValue.data(), sizeof(MotorConfig_t));
            saveMotorConfig(); // 儲存到 NVS
            Serial.println("[BLE Config] Motor config updated and saved via BLE.");
        } else {
            Serial.printf("[BLE Config] Write failed: Invalid size (%zu, expected %zu)\n", rxValue.length(), sizeof(MotorConfig_t));
        }
    }
};

// --- BLE 配置回調 (接收 Wi-Fi 憑證) ---
class ConfigCharacteristicCallbacks: public BLECharacteristicCallbacks {
    void onWrite(BLECharacteristic* pCharacteristic) {
        std::string rxValue = pCharacteristic->getValue();
        if (rxValue.length() > 0) {
            String data = String(rxValue.c_str());
            
            if (pCharacteristic == pSsidCharacteristic) {
                ble_ssid = data;
                Serial.printf("[BLE Config] Received SSID: %s\n", ble_ssid.c_str());
            } else if (pCharacteristic == pPassCharacteristic) {
                ble_pass = data;
                Serial.println("[BLE Config] Received Password.");
                
                if (ble_ssid.length() > 0) {
                    wifi_config_received = true; 
                    Serial.println("BLE 配置完成，準備儲存 Wi-Fi 憑證...");
                }
            }
        }
    }
};

// --- BLE 配置處理迴圈 (在收到憑證後重啟) ---
void handleBleConfigLoop() {
    if (wifi_config_received) {
        Serial.println("🚨 儲存新憑證並重啟中...");
        preferences.begin("wifi-config", false);
        preferences.putString("ssid", ble_ssid);
        preferences.putString("pass", ble_pass);
        preferences.end();
        wifi_config_received = false;
        
        delay(100); 
        ESP.restart();
    }
}

// --- setupBleServer_Bluedroid (新增馬達配置特徵) ---
void setupBleServer_Bluedroid() {
    BLEDevice::init(globalHostname.c_str());
    BLEDevice::setPower(ESP_PWR_LVL_P9);

    pServer = BLEDevice::createServer();
    pServer->setCallbacks(new MyServerCallbacks());

    // 1. 馬達控制服務
    BLEService *pControlService = pServer->createService(MOTOR_SERVICE_UUID);
    pControlCharacteristic = pControlService->createCharacteristic(
        MOTOR_CONTROL_CHAR_UUID, 
        BLECharacteristic::PROPERTY_WRITE | BLECharacteristic::PROPERTY_NOTIFY
    );
    pControlCharacteristic->addDescriptor(new BLE2902());
    pControlCharacteristic->setCallbacks(new MyCharacteristicCallbacks());

    // 2. 馬達配置特徵 (在控制服務下)
    pMotorConfigCharacteristic = pControlService->createCharacteristic(
        MOTOR_CONFIG_CHAR_UUID, 
        BLECharacteristic::PROPERTY_READ | BLECharacteristic::PROPERTY_WRITE | BLECharacteristic::PROPERTY_NOTIFY
    );
    pMotorConfigCharacteristic->addDescriptor(new BLE2902());
    pMotorConfigCharacteristic->setCallbacks(new MotorConfigCharacteristicCallbacks());


    // 3. Wi-Fi 配置服務
    BLEService *pConfigService = pServer->createService(CONFIG_SERVICE_UUID);
    
    pSsidCharacteristic = pConfigService->createCharacteristic(
        SSID_CHAR_UUID, 
        BLECharacteristic::PROPERTY_WRITE
    );
    pSsidCharacteristic->setCallbacks(new ConfigCharacteristicCallbacks());

    pPassCharacteristic = pConfigService->createCharacteristic(
        PASS_CHAR_UUID, 
        BLECharacteristic::PROPERTY_WRITE
    );
    pPassCharacteristic->setCallbacks(new ConfigCharacteristicCallbacks());
    
    // 啟動服務
    pConfigService->start();
    pControlService->start(); 

    // 4. 啟動廣告
    BLEAdvertising *pAdvertising = BLEDevice::getAdvertising();
    pAdvertising->addServiceUUID(CONFIG_SERVICE_UUID); 
    pAdvertising->addServiceUUID(MOTOR_SERVICE_UUID);
    pAdvertising->setScanResponse(true);
    pAdvertising->setMinPreferred(0x06); 
    pAdvertising->start(); 

